## Final Project: Avocado Prices

In [346]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import StandardScaler
from sklearn.preprocessing import LabelEncoder
import seaborn as sns
from scipy.stats import pearsonr

In [289]:
file = "data/avocado.csv"
raw_df = pd.read_csv(file)
raw_df.head(5)

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
0,0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,1,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany
2,2,2015-12-13,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany
3,3,2015-12-06,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
4,4,2015-11-29,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,conventional,2015,Albany

In [290]:
drop_cols_df = raw_df[['Date', 'AveragePrice', 'Total Volume', '4046', '4225',
                       '4770', 'Total Bags', 'Small Bags', 'Large Bags', 'XLarge Bags',
                       'type','year', 'region']]

In [291]:
column_rename_df = drop_cols_df.rename(columns={
    'AveragePrice':'Average Price',
    '4046':'PLU 4046',
    '4225':'PLU 4225',
    '4770':'PLU 4770',
    'XLarge Bags':'XL Bags',
    'type':'Type',
    'year':'Year',
    'region':'Region'    
})

In [292]:
column_rename_df.head(2)

,Date,Average Price,Total Volume,PLU 4046,PLU 4225,PLU 4770,Total Bags,Small Bags,Large Bags,XL Bags,Type,Year,Region
0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany

In [293]:
column_rename_df.count()

Date             18249
Average Price    18249
Total Volume     18249
PLU 4046         18249
PLU 4225         18249
PLU 4770         18249
Total Bags       18249
Small Bags       18249
Large Bags       18249
XL Bags          18249
Type             18249
Year             18249
Region           18249
dtype: int64

In [294]:
drop_na_df = column_rename_df.dropna(how='any')
drop_na_df.count()

Date             18249
Average Price    18249
Total Volume     18249
PLU 4046         18249
PLU 4225         18249
PLU 4770         18249
Total Bags       18249
Small Bags       18249
Large Bags       18249
XL Bags          18249
Type             18249
Year             18249
Region           18249
dtype: int64

In [295]:
drop_na_df.dtypes

Date              object
Average Price    float64
Total Volume     float64
PLU 4046         float64
PLU 4225         float64
PLU 4770         float64
Total Bags       float64
Small Bags       float64
Large Bags       float64
XL Bags          float64
Type              object
Year               int64
Region            object
dtype: object

In [296]:
drop_na_df.head(2)

,Date,Average Price,Total Volume,PLU 4046,PLU 4225,PLU 4770,Total Bags,Small Bags,Large Bags,XL Bags,Type,Year,Region
0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany

In [297]:
drop_na_df['Type'].unique()

array(['conventional', 'organic'], dtype=object)

In [298]:
drop_na_df['Region'].unique()

array(['Albany', 'Atlanta', 'BaltimoreWashington', 'Boise', 'Boston',
       'BuffaloRochester', 'California', 'Charlotte', 'Chicago',
       'CincinnatiDayton', 'Columbus', 'DallasFtWorth', 'Denver',
       'Detroit', 'GrandRapids', 'GreatLakes', 'HarrisburgScranton',
       'HartfordSpringfield', 'Houston', 'Indianapolis', 'Jacksonville',
       'LasVegas', 'LosAngeles', 'Louisville', 'MiamiFtLauderdale',
       'Midsouth', 'Nashville', 'NewOrleansMobile', 'NewYork',
       'Northeast', 'NorthernNewEngland', 'Orlando', 'Philadelphia',
       'PhoenixTucson', 'Pittsburgh', 'Plains', 'Portland',
       'RaleighGreensboro', 'RichmondNorfolk', 'Roanoke', 'Sacramento',
       'SanDiego', 'SanFrancisco', 'Seattle', 'SouthCarolina',
       'SouthCentral', 'Southeast', 'Spokane', 'StLouis', 'Syracuse',
       'Tampa', 'TotalUS', 'West', 'WestTexNewMexico'], dtype=object)

In [299]:
drop_na_df.head(5)

,Date,Average Price,Total Volume,PLU 4046,PLU 4225,PLU 4770,Total Bags,Small Bags,Large Bags,XL Bags,Type,Year,Region
0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany
2,2015-12-13,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany
3,2015-12-06,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
4,2015-11-29,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,conventional,2015,Albany

In [300]:
drop_na_df['Date'] = drop_na_df['Date'].str.split('-',2)

In [301]:
drop_na_df.head(5)

,Date,Average Price,Total Volume,PLU 4046,PLU 4225,PLU 4770,Total Bags,Small Bags,Large Bags,XL Bags,Type,Year,Region
0,"[2015, 12, 27]",1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,"[2015, 12, 20]",1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany
2,"[2015, 12, 13]",0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany
3,"[2015, 12, 06]",1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
4,"[2015, 11, 29]",1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,conventional,2015,Albany

In [354]:
month = []
for x in drop_na_df['Date']:
    month.append(pd.to_numeric(x[1]))

In [357]:
drop_na_df['Month'] = month
data_df = drop_na_df[['Month',
               'Average Price',
                'Total Volume',
                'PLU 4046',
                'PLU 4225',
                'PLU 4770',
                'Total Bags',
                'Small Bags',
                'Large Bags',
                'XL Bags',
                'Type',
                'Year',
                'Region']]
data_df.head()

,Month,Average Price,Total Volume,PLU 4046,PLU 4225,PLU 4770,Total Bags,Small Bags,Large Bags,XL Bags,Type,Year,Region
0,12,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,12,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany
2,12,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany
3,12,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
4,11,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,conventional,2015,Albany

In [358]:
data = pd.get_dummies(data_df)
data.head(5)

,Month,Average Price,Total Volume,PLU 4046,PLU 4225,PLU 4770,Total Bags,Small Bags,Large Bags,XL Bags,...,Region_SouthCarolina,Region_SouthCentral,Region_Southeast,Region_Spokane,Region_StLouis,Region_Syracuse,Region_Tampa,Region_TotalUS,Region_West,Region_WestTexNewMexico
0,12,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,...,0,0,0,0,0,0,0,0,0,0
1,12,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,...,0,0,0,0,0,0,0,0,0,0
2,12,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,...,0,0,0,0,0,0,0,0,0,0
3,12,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,...,0,0,0,0,0,0,0,0,0,0
4,11,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,...,0,0,0,0,0,0,0,0,0,0

In [379]:
cor_target = abs(cor["Average Price"])
#Selecting highly correlated features
relevant_features = cor_target[cor_target>0.1]
relevant_features

Month                         0.162409
Average Price                 1.000000
Total Volume                  0.192752
PLU 4046                      0.208317
PLU 4225                      0.172928
PLU 4770                      0.179446
Total Bags                    0.177088
Small Bags                    0.174730
Large Bags                    0.172940
XL Bags                       0.117592
Type_conventional             0.615845
Type_organic                  0.615845
Region_DallasFtWorth          0.109302
Region_HartfordSpringfield    0.140782
Region_Houston                0.122151
Region_NewYork                0.109714
Region_SanFrancisco           0.135856
Region_SouthCentral           0.103963
Name: Average Price, dtype: float64